{
    "Recommendation": {
        "2509.21317": {
            "title": "Interactive Recommendation Agent with Active User Commands",
            "authors": "Jiakai Tang, Yujie Luo, Xunke Xi, Fei Sun, Xueyang Feng, Sunhao Dai, Chao Yi, Dian Chen, Zhujin Gao, Yang Li, Xu Chen, Wen Chen, Jian Wu, Yuning Jiang, Bo Zheng",
            "first_author": "Jiakai Tang",
            "url": "http://arxiv.org/abs/2509.21317v1",
            "pdf_url": "http://arxiv.org/abs/2509.21317",
            "publish_date": "2025-09-25",
            "abstract": "Traditional recommender systems rely on passive feedback mechanisms that limit users to simple choices such as like and dislike. However, these coarse-grained signals fail to capture users' nuanced behavior motivations and intentions. In turn, current systems cannot also distinguish which specific item attributes drive user satisfaction or dissatisfaction, resulting in inaccurate preference modeling. These fundamental limitations create a persistent gap between user intentions and system interpretations, ultimately undermining user satisfaction and harming system effectiveness.   To address these limitations, we introduce the Interactive Recommendation Feed (IRF), a pioneering paradigm that enables natural language commands within mainstream recommendation feeds. Unlike traditional systems that confine users to passive implicit behavioral influence, IRF empowers active explicit control over recommendation policies through real-time linguistic commands. To support this paradigm, we develop RecBot, a dual-agent architecture where a Parser Agent transforms linguistic expressions into structured preferences and a Planner Agent dynamically orchestrates adaptive tool chains for on-the-fly policy adjustment. To enable practical deployment, we employ simulation-augmented knowledge distillation to achieve efficient performance while maintaining strong reasoning capabilities. Through extensive offline and long-term online experiments, RecBot shows significant improvements in both user satisfaction and business outcomes.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.21179": {
            "title": "IntSR: An Integrated Generative Framework for Search and Recommendation",
            "authors": "Huimin Yan, Longfei Xu, Junjie Sun, Ni Ou, Wei Luo, Xing Tan, Ran Cheng, Kaikui Liu, Xiangxiang Chu",
            "first_author": "Huimin Yan",
            "url": "http://arxiv.org/abs/2509.21179v1",
            "pdf_url": "http://arxiv.org/abs/2509.21179",
            "publish_date": "2025-09-25",
            "abstract": "Generative recommendation has emerged as a promising paradigm, demonstrating remarkable results in both academic benchmarks and industrial applications. However, existing systems predominantly focus on unifying retrieval and ranking while neglecting the integration of search and recommendation (S&R) tasks. What makes search and recommendation different is how queries are formed: search uses explicit user requests, while recommendation relies on implicit user interests. As for retrieval versus ranking, the distinction comes down to whether the queries are the target items themselves. Recognizing the query as central element, we propose IntSR, an integrated generative framework for S&R. IntSR integrates these disparate tasks using distinct query modalities. It also addresses the increased computational complexity associated with integrated S&R behaviors and the erroneous pattern learning introduced by a dynamically changing corpus. IntSR has been successfully deployed across various scenarios in Amap, leading to substantial improvements in digital asset's GMV(+3.02%), POI recommendation's CTR(+2.76%), and travel mode suggestion's ACC(+5.13%).",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.20883": {
            "title": "RecIS: Sparse to Dense, A Unified Training Framework for Recommendation Models",
            "authors": "Hua Zong, Qingtao Zeng, Zhengxiong Zhou, Zhihua Han, Zhensong Yan, Mingjie Liu, Hechen Sun, Jiawei Liu, Yiwen Hu, Qi Wang, YiHan Xian, Wenjie Guo, Houyuan Xiang, Zhiyuan Zeng, Xiangrong Sheng, Bencheng Yan, Nan Hu, Yuheng Huang, Jinqing Lian, Ziru Xu, Yan Zhang, Ju Huang, Siran Yang, Huimin Yi, Jiamang Wang, Pengjie Wang, Han Zhu, Jian Wu, Dan Ou, Jian Xu, Haihong Tang, Yuning Jiang, Bo Zheng, Lin Qu",
            "first_author": "Hua Zong",
            "url": "http://arxiv.org/abs/2509.20883v1",
            "pdf_url": "http://arxiv.org/abs/2509.20883",
            "publish_date": "2025-09-25",
            "abstract": "In this paper, we propose RecIS, a unified Sparse-Dense training framework designed to achieve two primary goals: 1. Unified Framework To create a Unified sparse-dense training framework based on the PyTorch ecosystem that meets the training needs of industrial-grade recommendation models that integrated with large models. 2.System Optimization To optimize the sparse component, offering superior efficiency over the TensorFlow-based recommendation models. The dense component, meanwhile, leverages existing optimization technologies within the PyTorch ecosystem. Currently, RecIS is being used in Alibaba for numerous large-model enhanced recommendation training tasks, and some traditional sparse models have also begun training in it.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.20225": {
            "title": "Multimodal Representation-disentangled Information Bottleneck for Multimodal Recommendation",
            "authors": "Hui Wang, Jinghui Qin, Wushao Wen, Qingling Li, Shanshan Zhong, Zhongzhan Huang",
            "first_author": "Hui Wang",
            "url": "http://arxiv.org/abs/2509.20225v1",
            "pdf_url": "http://arxiv.org/abs/2509.20225",
            "publish_date": "2025-09-24",
            "abstract": "Multimodal data has significantly advanced recommendation systems by integrating diverse information sources to model user preferences and item characteristics. However, these systems often struggle with redundant and irrelevant information, which can degrade performance. Most existing methods either fuse multimodal information directly or use rigid architectural separation for disentanglement, failing to adequately filter noise and model the complex interplay between modalities. To address these challenges, we propose a novel framework, the Multimodal Representation-disentangled Information Bottleneck (MRdIB). Concretely, we first employ a Multimodal Information Bottleneck to compress the input representations, effectively filtering out task-irrelevant noise while preserving rich semantic information. Then, we decompose the information based on its relationship with the recommendation target into unique, redundant, and synergistic components. We achieve this decomposition with a series of constraints: a unique information learning objective to preserve modality-unique signals, a redundant information learning objective to minimize overlap, and a synergistic information learning objective to capture emergent information. By optimizing these objectives, MRdIB guides a model to learn more powerful and disentangled representations. Extensive experiments on several competitive models and three benchmark datasets demonstrate the effectiveness and versatility of our MRdIB in enhancing multimodal recommendation.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.19955": {
            "title": "Multimodal-enhanced Federated Recommendation: A Group-wise Fusion Approach",
            "authors": "Chunxu Zhang, Weipeng Zhang, Guodong Long, Zhiheng Xue, Riting Xia, Bo Yang",
            "first_author": "Chunxu Zhang",
            "url": "http://arxiv.org/abs/2509.19955v1",
            "pdf_url": "http://arxiv.org/abs/2509.19955",
            "publish_date": "2025-09-24",
            "abstract": "Federated Recommendation (FR) is a new learning paradigm to tackle the learn-to-rank problem in a privacy-preservation manner. How to integrate multi-modality features into federated recommendation is still an open challenge in terms of efficiency, distribution heterogeneity, and fine-grained alignment. To address these challenges, we propose a novel multimodal fusion mechanism in federated recommendation settings (GFMFR). Specifically, it offloads multimodal representation learning to the server, which stores item content and employs a high-capacity encoder to generate expressive representations, alleviating client-side overhead. Moreover, a group-aware item representation fusion approach enables fine-grained knowledge sharing among similar users while retaining individual preferences. The proposed fusion loss could be simply plugged into any existing federated recommender systems empowering their capability by adding multi-modality features. Extensive experiments on five public benchmark datasets demonstrate that GFMFR consistently outperforms state-of-the-art multimodal FR baselines.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.19469": {
            "title": "MusiCRS: Benchmarking Audio-Centric Conversational Recommendation",
            "authors": "Rohan Surana, Amit Namburi, Gagan Mundada, Abhay Lal, Zachary Novack, Julian McAuley, Junda Wu",
            "first_author": "Rohan Surana",
            "url": "http://arxiv.org/abs/2509.19469v1",
            "pdf_url": "http://arxiv.org/abs/2509.19469",
            "publish_date": "2025-09-23",
            "abstract": "Conversational recommendation has advanced rapidly with large language models (LLMs), yet music remains a uniquely challenging domain where effective recommendations require reasoning over audio content beyond what text or metadata can capture. We present MusiCRS, the first benchmark for audio-centric conversational recommendation that links authentic user conversations from Reddit with corresponding audio tracks. MusiCRS contains 477 high-quality conversations spanning diverse genres (classical, hip-hop, electronic, metal, pop, indie, jazz) with 3,589 unique musical entities and audio grounding via YouTube links. MusiCRS enables evaluation across three input modality configurations: audio-only, query-only, and audio+query (multimodal), allowing systematic comparison of audio-LLMs, retrieval models, and traditional approaches. Our experiments reveal that current systems rely heavily on textual signals and struggle with nuanced audio reasoning. This exposes fundamental limitations in cross-modal knowledge integration where models excel at dialogue semantics but cannot effectively ground abstract musical concepts in actual audio content. To facilitate progress, we release the MusiCRS dataset (https://huggingface.co/datasets/rohan2810/MusiCRS), evaluation code (https://github.com/rohan2810/musiCRS), and comprehensive baselines.",
            "primary_category": "cs.SD",
            "code_url": "null"
        },
        "2509.18807": {
            "title": "Single-Branch Network Architectures to Close the Modality Gap in Multimodal Recommendation",
            "authors": "Christian Ganhör, Marta Moscati, Anna Hausberger, Shah Nawaz, Markus Schedl",
            "first_author": "Christian Ganhör",
            "url": "http://arxiv.org/abs/2509.18807v1",
            "pdf_url": "http://arxiv.org/abs/2509.18807",
            "publish_date": "2025-09-23",
            "abstract": "Traditional recommender systems rely on collaborative filtering, using past user-item interactions to help users discover new items in a vast collection. In cold start, i.e., when interaction histories of users or items are not available, content-based recommender systems use side information instead. Hybrid recommender systems (HRSs) often employ multimodal learning to combine collaborative and side information, which we jointly refer to as modalities. Though HRSs can provide recommendations when some modalities are missing, their quality degrades. In this work, we utilize single-branch neural networks equipped with weight sharing, modality sampling, and contrastive loss to provide accurate recommendations even in missing modality scenarios by narrowing the modality gap. We compare these networks with multi-branch alternatives and conduct extensive experiments on three datasets. Six accuracy-based and four beyond-accuracy-based metrics help assess the recommendation quality for the different training paradigms and their hyperparameters in warm-start and missing modality scenarios. We quantitatively and qualitatively study the effects of these different aspects on bridging the modality gap. Our results show that single-branch networks achieve competitive performance in warm-start scenarios and are significantly better in missing modality settings. Moreover, our approach leads to closer proximity of an item's modalities in the embedding space. Our full experimental setup is available at https://github.com/hcai-mms/single-branch-networks.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.17945": {
            "title": "Improving Neutrino-Nuclei Interaction Models: Recommendations and Case Studies on Peelle's Pertinent Puzzle",
            "authors": "S. Abe, L. Aliaga-Soplin, J. Barrow, L. Bathe-Peters, B. Bogart, L. Cooper-Troendle, R. Diurba, S. Dytman, S. Gardiner, L. Hagaman, M. S. Ismail, J. Issacson, J. Kim, L. Liu, J. McKean, N. Nayak, A. Papadopoulou, L. Pickering, X. Qian, K. Skwarczynski, J. Tena Vidal, J. Wolfs",
            "first_author": "S. Abe",
            "url": "http://arxiv.org/abs/2509.17945v1",
            "pdf_url": "http://arxiv.org/abs/2509.17945",
            "publish_date": "2025-09-22",
            "abstract": "Improving the modeling of neutrino-nuclei interactions using data-driven methods is crucial for high-precision neutrino oscillation experiments. This paper investigates Peelle's Pertinent Puzzle (PPP) in the context of neutrino measurements, a longstanding challenge to fitting theoretical models to experimental data. Inconsistencies in data-model comparisons hinder efforts to enhance the accuracy and reliability of model predictions. We analyze various sources contributing to these inconsistencies and propose strategies to address them, supported by practical case studies. We advocate for incorporating model fitting exercises as a standard practice in cross section publications to enhance the robustness of results. We use a common analysis framework to explore PPP-related challenges with MicroBooNE and T2K data in an unified manner. Our findings offer valuable insights for improving the accuracy and reliability of neutrino-nuclei interaction models, particularly by systematically tuning models using data.",
            "primary_category": "hep-ex",
            "code_url": "null"
        },
        "2509.18226": {
            "title": "From \"What to Eat?\" to Perfect Recipe: ChefMind's Chain-of-Exploration for Ambiguous User Intent in Recipe Recommendation",
            "authors": "Yu Fu, Linyue Cai, Ruoyu Wu, Yong Zhao",
            "first_author": "Yu Fu",
            "url": "http://arxiv.org/abs/2509.18226v1",
            "pdf_url": "http://arxiv.org/abs/2509.18226",
            "publish_date": "2025-09-22",
            "abstract": "Personalized recipe recommendation faces challenges in handling fuzzy user intent, ensuring semantic accuracy, and providing sufficient detail coverage. We propose ChefMind, a hybrid architecture combining Chain of Exploration (CoE), Knowledge Graph (KG), Retrieval-Augmented Generation (RAG), and a Large Language Model (LLM). CoE refines ambiguous queries into structured conditions, KG offers semantic reasoning and interpretability, RAG supplements contextual culinary details, and LLM integrates outputs into coherent recommendations. We evaluate ChefMind on the Xiachufang dataset and manually annotated queries, comparing it with LLM-only, KG-only, and RAG-only baselines. Results show that ChefMind achieves superior performance in accuracy, relevance, completeness, and clarity, with an average score of 8.7 versus 6.4-6.7 for ablation models. Moreover, it reduces unprocessed queries to 1.6%, demonstrating robustness in handling fuzzy demands.",
            "primary_category": "cs.AI",
            "code_url": "null"
        },
        "2509.17361": {
            "title": "SeqUDA-Rec: Sequential User Behavior Enhanced Recommendation via Global Unsupervised Data Augmentation for Personalized Content Marketing",
            "authors": "Ruihan Luo, Xuanjing Chen, Ziyang Ding",
            "first_author": "Ruihan Luo",
            "url": "http://arxiv.org/abs/2509.17361v1",
            "pdf_url": "http://arxiv.org/abs/2509.17361",
            "publish_date": "2025-09-22",
            "abstract": "Personalized content marketing has become a crucial strategy for digital platforms, aiming to deliver tailored advertisements and recommendations that match user preferences. Traditional recommendation systems often suffer from two limitations: (1) reliance on limited supervised signals derived from explicit user feedback, and (2) vulnerability to noisy or unintentional interactions. To address these challenges, we propose SeqUDA-Rec, a novel deep learning framework that integrates user behavior sequences with global unsupervised data augmentation to enhance recommendation accuracy and robustness. Our approach first constructs a Global User-Item Interaction Graph (GUIG) from all user behavior sequences, capturing both local and global item associations. Then, a graph contrastive learning module is applied to generate robust embeddings, while a sequential Transformer-based encoder models users' evolving preferences. To further enhance diversity and counteract sparse supervised labels, we employ a GAN-based augmentation strategy, generating plausible interaction patterns and supplementing training data. Extensive experiments on two real-world marketing datasets (Amazon Ads and TikTok Ad Clicks) demonstrate that SeqUDA-Rec significantly outperforms state-of-the-art baselines such as SASRec, BERT4Rec, and GCL4SR. Our model achieves a 6.7% improvement in NDCG@10 and 11.3% improvement in HR@10, proving its effectiveness in personalized advertising and intelligent content recommendation.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.17265": {
            "title": "Identifying and Upweighting Power-Niche Users to Mitigate Popularity Bias in Recommendations",
            "authors": "David Liu, Erik Weis, Moritz Laber, Tina Eliassi-Rad, Brennan Klein",
            "first_author": "David Liu",
            "url": "http://arxiv.org/abs/2509.17265v1",
            "pdf_url": "http://arxiv.org/abs/2509.17265",
            "publish_date": "2025-09-21",
            "abstract": "Recommender systems have been shown to exhibit popularity bias by over-recommending popular items and under-recommending relevant niche items. We seek to understand interactions with niche items in benchmark recommendation datasets as a step toward mitigating popularity bias. We find that, compared to mainstream users, niche-preferring users exhibit a longer-tailed activity-level distribution, indicating the existence of users who both prefer niche items and exhibit high activity levels. We partition users along two axes: (1) activity level (\"power\" vs. \"light\") and (2) item-popularity preference (\"mainstream\" vs. \"niche\"), and show that in several benchmark datasets, the number of power-niche users (high activity and niche preference) is statistically significantly larger than expected under a null configuration model. Motivated by this observation, we propose a framework for reweighting the Bayesian Personalized Ranking (BPR) loss that simultaneously reweights based on user activity level and item popularity. Our method introduces two interpretable parameters: one controlling the significance of user activity level, and the other of item popularity. Experiments on benchmark datasets show that upweighting power-niche users reduces popularity bias and can increase overall performance. In contrast to previous work that only considers user activity level or item popularity in isolation, our results suggest that considering their interaction leads to Pareto-dominant performance.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.17066": {
            "title": "RALLM-POI: Retrieval-Augmented LLM for Zero-shot Next POI Recommendation with Geographical Reranking",
            "authors": "Kunrong Li, Kwan Hui Lim",
            "first_author": "Kunrong Li",
            "url": "http://arxiv.org/abs/2509.17066v1",
            "pdf_url": "http://arxiv.org/abs/2509.17066",
            "publish_date": "2025-09-21",
            "abstract": "Next point-of-interest (POI) recommendation predicts a user's next destination from historical movements. Traditional models require intensive training, while LLMs offer flexible and generalizable zero-shot solutions but often generate generic or geographically irrelevant results due to missing trajectory and spatial context. To address these issues, we propose RALLM-POI, a framework that couples LLMs with retrieval-augmented generation and self-rectification. We first propose a Historical Trajectory Retriever (HTR) that retrieves relevant past trajectories to serve as contextual references, which are then reranked by a Geographical Distance Reranker (GDR) for prioritizing spatially relevant trajectories. Lastly, an Agentic LLM Rectifier (ALR) is designed to refine outputs through self-reflection. Without additional training, RALLM-POI achieves substantial accuracy gains across three real-world Foursquare datasets, outperforming both conventional and LLM-based baselines. Code is released at https://github.com/LKRcrocodile/RALLM-POI.",
            "primary_category": "cs.AI",
            "code_url": "null"
        },
        "2509.20381": {
            "title": "USB-Rec: An Effective Framework for Improving Conversational Recommendation Capability of Large Language Model",
            "authors": "Jianyu Wen, Jingyun Wang, Cilin Yan, Jiayin Cai, Xiaolong Jiang, Ying Zhang",
            "first_author": "Jianyu Wen",
            "url": "http://arxiv.org/abs/2509.20381v1",
            "pdf_url": "http://arxiv.org/abs/2509.20381",
            "publish_date": "2025-09-20",
            "abstract": "Recently, Large Language Models (LLMs) have been widely employed in Conversational Recommender Systems (CRSs). Unlike traditional language model approaches that focus on training, all existing LLMs-based approaches are mainly centered around how to leverage the summarization and analysis capabilities of LLMs while ignoring the issue of training. Therefore, in this work, we propose an integrated training-inference framework, User-Simulator-Based framework (USB-Rec), for improving the performance of LLMs in conversational recommendation at the model level. Firstly, we design a LLM-based Preference Optimization (PO) dataset construction strategy for RL training, which helps the LLMs understand the strategies and methods in conversational recommendation. Secondly, we propose a Self-Enhancement Strategy (SES) at the inference stage to further exploit the conversational recommendation potential obtained from RL training. Extensive experiments on various datasets demonstrate that our method consistently outperforms previous state-of-the-art methods.",
            "primary_category": "cs.CL",
            "code_url": "null"
        },
        "2509.16446": {
            "title": "Purely Semantic Indexing for LLM-based Generative Recommendation and Retrieval",
            "authors": "Ruohan Zhang, Jiacheng Li, Julian McAuley, Yupeng Hou",
            "first_author": "Ruohan Zhang",
            "url": "http://arxiv.org/abs/2509.16446v1",
            "pdf_url": "http://arxiv.org/abs/2509.16446",
            "publish_date": "2025-09-19",
            "abstract": "Semantic identifiers (IDs) have proven effective in adapting large language models for generative recommendation and retrieval. However, existing methods often suffer from semantic ID conflicts, where semantically similar documents (or items) are assigned identical IDs. A common strategy to avoid conflicts is to append a non-semantic token to distinguish them, which introduces randomness and expands the search space, therefore hurting performance. In this paper, we propose purely semantic indexing to generate unique, semantic-preserving IDs without appending non-semantic tokens. We enable unique ID assignment by relaxing the strict nearest-centroid selection and introduce two model-agnostic algorithms: exhaustive candidate matching (ECM) and recursive residual searching (RRS). Extensive experiments on sequential recommendation, product search, and document retrieval tasks demonstrate that our methods improve both overall and cold-start performance, highlighting the effectiveness of ensuring ID uniqueness.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.13957": {
            "title": "Enhancing Time Awareness in Generative Recommendation",
            "authors": "Sunkyung Lee, Seongmin Park, Jonghyo Kim, Mincheol Yoon, Jongwuk Lee",
            "first_author": "Sunkyung Lee",
            "url": "http://arxiv.org/abs/2509.13957v1",
            "pdf_url": "http://arxiv.org/abs/2509.13957",
            "publish_date": "2025-09-17",
            "abstract": "Generative recommendation has emerged as a promising paradigm that formulates the recommendations into a text-to-text generation task, harnessing the vast knowledge of large language models. However, existing studies focus on considering the sequential order of items and neglect to handle the temporal dynamics across items, which can imply evolving user preferences. To address this limitation, we propose a novel model, Generative Recommender Using Time awareness (GRUT), effectively capturing hidden user preferences via various temporal signals. We first introduce Time-aware Prompting, consisting of two key contexts. The user-level temporal context models personalized temporal patterns across timestamps and time intervals, while the item-level transition context provides transition patterns across users. We also devise Trend-aware Inference, a training-free method that enhances rankings by incorporating trend information about items with generation likelihood. Extensive experiments demonstrate that GRUT outperforms state-of-the-art models, with gains of up to 15.4% and 14.3% in Recall@5 and NDCG@5 across four benchmark datasets. The source code is available at https://github.com/skleee/GRUT.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.13773": {
            "title": "MIRA: Empowering One-Touch AI Services on Smartphones with MLLM-based Instruction Recommendation",
            "authors": "Zhipeng Bian, Jieming Zhu, Xuyang Xie, Quanyu Dai, Zhou Zhao, Zhenhua Dong",
            "first_author": "Zhipeng Bian",
            "url": "http://arxiv.org/abs/2509.13773v1",
            "pdf_url": "http://arxiv.org/abs/2509.13773",
            "publish_date": "2025-09-17",
            "abstract": "The rapid advancement of generative AI technologies is driving the integration of diverse AI-powered services into smartphones, transforming how users interact with their devices. To simplify access to predefined AI services, this paper introduces MIRA, a pioneering framework for task instruction recommendation that enables intuitive one-touch AI tasking on smartphones. With MIRA, users can long-press on images or text objects to receive contextually relevant instruction recommendations for executing AI tasks. Our work introduces three key innovations: 1) A multimodal large language model (MLLM)-based recommendation pipeline with structured reasoning to extract key entities, infer user intent, and generate precise instructions; 2) A template-augmented reasoning mechanism that integrates high-level reasoning templates, enhancing task inference accuracy; 3) A prefix-tree-based constrained decoding strategy that restricts outputs to predefined instruction candidates, ensuring coherent and intent-aligned suggestions. Through evaluation using a real-world annotated datasets and a user study, MIRA has demonstrated substantial improvements in the accuracy of instruction recommendation. The encouraging results highlight MIRA's potential to revolutionize the way users engage with AI services on their smartphones, offering a more seamless and efficient experience.",
            "primary_category": "cs.AI",
            "code_url": "null"
        },
        "2509.13648": {
            "title": "Sequential Data Augmentation for Generative Recommendation",
            "authors": "Geon Lee, Bhuvesh Kumar, Clark Mingxuan Ju, Tong Zhao, Kijung Shin, Neil Shah, Liam Collins",
            "first_author": "Geon Lee",
            "url": "http://arxiv.org/abs/2509.13648v1",
            "pdf_url": "http://arxiv.org/abs/2509.13648",
            "publish_date": "2025-09-17",
            "abstract": "Generative recommendation plays a crucial role in personalized systems, predicting users' future interactions from their historical behavior sequences. A critical yet underexplored factor in training these models is data augmentation, the process of constructing training data from user interaction histories. By shaping the training distribution, data augmentation directly and often substantially affects model generalization and performance. Nevertheless, in much of the existing work, this process is simplified, applied inconsistently, or treated as a minor design choice, without a systematic and principled understanding of its effects.   Motivated by our empirical finding that different augmentation strategies can yield large performance disparities, we conduct an in-depth analysis of how they reshape training distributions and influence alignment with future targets and generalization to unseen inputs. To systematize this design space, we propose GenPAS, a generalized and principled framework that models augmentation as a stochastic sampling process over input-target pairs with three bias-controlled steps: sequence sampling, target sampling, and input sampling. This formulation unifies widely used strategies as special cases and enables flexible control of the resulting training distribution. Our extensive experiments on benchmark and industrial datasets demonstrate that GenPAS yields superior accuracy, data efficiency, and parameter efficiency compared to existing strategies, providing practical guidance for principled training data construction in generative recommendation.",
            "primary_category": "cs.LG",
            "code_url": "null"
        },
        "2509.13462": {
            "title": "Strategic Pricing and Ranking in Recommendation Systems with Seller Competition",
            "authors": "Tushar Shankar Walunj, Veeraruna Kavitha, Jayakrishnan Nair, Priyank Agarwal",
            "first_author": "Tushar Shankar Walunj",
            "url": "http://arxiv.org/abs/2509.13462v1",
            "pdf_url": "http://arxiv.org/abs/2509.13462",
            "publish_date": "2025-09-16",
            "abstract": "We study a recommendation system where sellers compete for visibility by strategically offering commissions to a platform that optimally curates a ranked menu of items and their respective prices for each customer. Customers interact sequentially with the menu following a cascade click model, and their purchase decisions are influenced by price sensitivity and positions of various items in the menu. We model the seller-platform interaction as a Stackelberg game with sellers as leaders and consider two different games depending on whether the prices are set by the platform or prefixed by the sellers. It is complicated to find the optimal policy of the platform in complete generality; hence, we solve the problem in an important asymptotic regime.   The core contribution of this paper lies in characterizing the equilibrium structure of the limit game. We show that when sellers are of different strengths, the standard Nash equilibrium does not exist due to discontinuities in utilities. We instead establish the existence of a novel equilibrium solution, namely `$\\mu$-connected equilibrium cycle' ($\\mu$-EC), which captures oscillatory strategic responses at the equilibrium. Unlike the (pure) Nash equilibrium, which defines a fixed point of mutual best responses, this is a set-valued solution concept of connected components. This novel equilibrium concept identifies a Cartesian product set of connected action profiles in the continuous action space that satisfies four important properties: stability against external deviations, no external chains, instability against internal deviations, and minimality. We extend a recently introduced solution concept equilibrium cycle to include stability against measure-zero violations and, by avoiding topological difficulties to propose $\\mu$-EC.",
            "primary_category": "econ.TH",
            "code_url": "null"
        },
        "2509.13179": {
            "title": "Efficient Cold-Start Recommendation via BPE Token-Level Embedding Initialization with LLM",
            "authors": "Yushang Zhao, Xinyue Han, Qian Leng, Qianyi Sun, Haotian Lyu, Chengrui Zhou",
            "first_author": "Yushang Zhao",
            "url": "http://arxiv.org/abs/2509.13179v1",
            "pdf_url": "http://arxiv.org/abs/2509.13179",
            "publish_date": "2025-09-16",
            "abstract": "The cold-start issue is the challenge when we talk about recommender systems, especially in the case when we do not have the past interaction data of new users or new items. Content-based features or hybrid solutions are common as conventional solutions, but they can only work in a sparse metadata environment with shallow patterns. In this paper, the efficient cold-start recommendation strategy is presented, which is based on the sub word-level representations by applying Byte Pair Encoding (BPE) tokenization and pre-trained Large Language Model (LLM) embedding in the initialization procedure. We obtain fine-grained token-level vectors that are aligned with the BPE vocabulary as opposed to using coarse-grained sentence embeddings. Together, these token embeddings can be used as dense semantic priors on unseen entities, making immediate recommendation performance possible without user-item interaction history. Our mechanism can be compared to collaborative filtering systems and tested over benchmark datasets with stringent cold-start assumptions. Experimental findings show that the given BPE-LLM method achieves higher Recall@k, NDCG@k, and Hit Rate measurements compared to the standard baseline and displays the same capability of sufficient computational performance. Furthermore, we demonstrate that using subword-aware embeddings yields better generalizability and is more interpretable, especially within a multilingual and sparse input setting. The practical application of token-level semantic initialization as a lightweight, but nevertheless effective extension to modern recommender systems in the zero-shot setting is indicated within this work.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.12382": {
            "title": "LLM-as-a-Judge: Rapid Evaluation of Legal Document Recommendation for Retrieval-Augmented Generation",
            "authors": "Anu Pradhan, Alexandra Ortan, Apurv Verma, Madhavan Seshadri",
            "first_author": "Anu Pradhan",
            "url": "http://arxiv.org/abs/2509.12382v1",
            "pdf_url": "http://arxiv.org/abs/2509.12382",
            "publish_date": "2025-09-15",
            "abstract": "The evaluation bottleneck in recommendation systems has become particularly acute with the rise of Generative AI, where traditional metrics fall short of capturing nuanced quality dimensions that matter in specialized domains like legal research. Can we trust Large Language Models to serve as reliable judges of their own kind? This paper investigates LLM-as-a-Judge as a principled approach to evaluating Retrieval-Augmented Generation systems in legal contexts, where the stakes of recommendation quality are exceptionally high.   We tackle two fundamental questions that determine practical viability: which inter-rater reliability metrics best capture the alignment between LLM and human assessments, and how do we conduct statistically sound comparisons between competing systems? Through systematic experimentation, we discover that traditional agreement metrics like Krippendorff's alpha can be misleading in the skewed distributions typical of AI system evaluations. Instead, Gwet's AC2 and rank correlation coefficients emerge as more robust indicators for judge selection, while the Wilcoxon Signed-Rank Test with Benjamini-Hochberg corrections provides the statistical rigor needed for reliable system comparisons.   Our findings suggest a path toward scalable, cost-effective evaluation that maintains the precision demanded by legal applications, transforming what was once a human-intensive bottleneck into an automated, yet statistically principled, evaluation framework.",
            "primary_category": "cs.CL",
            "code_url": "null"
        },
        "2509.12361": {
            "title": "What News Recommendation Research Did (But Mostly Didn't) Teach Us About Building A News Recommender",
            "authors": "Karl Higley, Robin Burke, Michael D. Ekstrand, Bart P. Knijnenburg",
            "first_author": "Karl Higley",
            "url": "http://arxiv.org/abs/2509.12361v1",
            "pdf_url": "http://arxiv.org/abs/2509.12361",
            "publish_date": "2025-09-15",
            "abstract": "One of the goals of recommender systems research is to provide insights and methods that can be used by practitioners to build real-world systems that deliver high-quality recommendations to actual people grounded in their genuine interests and needs. We report on our experience trying to apply the news recommendation literature to build POPROX, a live platform for news recommendation research, and reflect on the extent to which the current state of research supports system-building efforts. Our experience highlights several unexpected challenges encountered in building personalization features that are commonly found in products from news aggregators and publishers, and shows how those difficulties are connected to surprising gaps in the literature. Finally, we offer a set of lessons learned from building a live system with a persistent user base and highlight opportunities to make future news recommendation research more applicable and impactful in practice.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.12350": {
            "title": "Knowledge Graph Tokenization for Behavior-Aware Generative Next POI Recommendation",
            "authors": "Ke Sun, Mayi Xu",
            "first_author": "Ke Sun",
            "url": "http://arxiv.org/abs/2509.12350v1",
            "pdf_url": "http://arxiv.org/abs/2509.12350",
            "publish_date": "2025-09-15",
            "abstract": "Generative paradigm, especially powered by Large Language Models (LLMs), has emerged as a new solution to the next point-of-interest (POI) recommendation. Pioneering studies usually adopt a two-stage pipeline, starting with a tokenizer converting POIs into discrete identifiers that can be processed by LLMs, followed by POI behavior prediction tasks to instruction-tune LLM for next POI recommendation. Despite of remarkable progress, they still face two limitations: (1) existing tokenizers struggle to encode heterogeneous signals in the recommendation data, suffering from information loss issue, and (2) previous instruction-tuning tasks only focus on users' POI visit behavior while ignore other behavior types, resulting in insufficient understanding of mobility. To address these limitations, we propose KGTB (Knowledge Graph Tokenization for Behavior-aware generative next POI recommendation). Specifically, KGTB organizes the recommendation data in a knowledge graph (KG) format, of which the structure can seamlessly preserve the heterogeneous information. Then, a KG-based tokenizer is developed to quantize each node into an individual structural ID. This process is supervised by the KG's structure, thus reducing the loss of heterogeneous information. Using generated IDs, KGTB proposes multi-behavior learning that introduces multiple behavior-specific prediction tasks for LLM fine-tuning, e.g., POI, category, and region visit behaviors. Learning on these behavior tasks provides LLMs with comprehensive insights on the target POI visit behavior. Experiments on four real-world city datasets demonstrate the superior performance of KGTB.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.11524": {
            "title": "Decoding in Latent Spaces for Efficient Inference in LLM-based Recommendation",
            "authors": "Chengbing Wang, Yang Zhang, Zhicheng Wang, Tianhao Shi, Keqin Bao, Fuli Feng, Tat-Seng Chua",
            "first_author": "Chengbing Wang",
            "url": "http://arxiv.org/abs/2509.11524v1",
            "pdf_url": "http://arxiv.org/abs/2509.11524",
            "publish_date": "2025-09-15",
            "abstract": "Fine-tuning large language models (LLMs) for recommendation in a generative manner has delivered promising results, but encounters significant inference overhead due to autoregressive decoding in the language space. This work explores bypassing language-space decoding by directly matching candidate items with the LLM's internal thought representations in the latent space, eliminating the time-consuming autoregressive process to reduce computational costs. Towards this, we introduce Light Latent-space Decoding (L2D), an effective and efficient latent-space decoding method. L2D represents user-preferred items by using the hidden states of test sequences reflecting the LLM's internal thought, and obtains candidate item representations from the hidden states of training sequences labeled with the corresponding candidate items. It then matches the two types of representations to decode items, achieving latent-space decoding. In this way, it enables efficient decoding without altering the LLM's generative tuning paradigm, thereby preserving performance. Extensive empirical results demonstrate that L2D is more than 10x faster than language-space decoding while maintaining or enhancing performance.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.11139": {
            "title": "Understanding the Information Cocoon: A Multidimensional Assessment and Analysis of News Recommendation Systems",
            "authors": "Xin Wang, Xiaowen Huang, Jitao Sang",
            "first_author": "Xin Wang",
            "url": "http://arxiv.org/abs/2509.11139v1",
            "pdf_url": "http://arxiv.org/abs/2509.11139",
            "publish_date": "2025-09-14",
            "abstract": "Personalized news recommendation systems inadvertently create information cocoons--homogeneous information bubbles that reinforce user biases and amplify societal polarization. To address the lack of comprehensive assessment frameworks in prior research, we propose a multidimensional analysis that evaluates cocoons through dual perspectives: (1) Individual homogenization via topic diversity (including the number of topic categories and category information entropy) and click repetition; (2) Group polarization via network density and community openness. Through multi-round experiments on real-world datasets, we benchmark seven algorithms and reveal critical insights. Furthermore, we design five lightweight mitigation strategies. This work establishes the first unified metric framework for information cocoons and delivers deployable solutions for ethical recommendation systems.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.11094": {
            "title": "SPARK: Adaptive Low-Rank Knowledge Graph Modeling in Hybrid Geometric Spaces for Recommendation",
            "authors": "Binhao Wang, Yutian Xiao, Maolin Wang, Zhiqi Li, Tianshuo Wei, Ruocheng Guo, Xiangyu Zhao",
            "first_author": "Binhao Wang",
            "url": "http://arxiv.org/abs/2509.11094v1",
            "pdf_url": "http://arxiv.org/abs/2509.11094",
            "publish_date": "2025-09-14",
            "abstract": "Knowledge Graphs (KGs) enhance recommender systems but face challenges from inherent noise, sparsity, and Euclidean geometry's inadequacy for complex relational structures, critically impairing representation learning, especially for long-tail entities. Existing methods also often lack adaptive multi-source signal fusion tailored to item popularity. This paper introduces SPARK, a novel multi-stage framework systematically tackling these issues. SPARK first employs Tucker low-rank decomposition to denoise KGs and generate robust entity representations. Subsequently, an SVD-initialized hybrid geometric GNN concurrently learns representations in Euclidean and Hyperbolic spaces; the latter is strategically leveraged for its aptitude in modeling hierarchical structures, effectively capturing semantic features of sparse, long-tail items. A core contribution is an item popularity-aware adaptive fusion strategy that dynamically weights signals from collaborative filtering, refined KG embeddings, and diverse geometric spaces for precise modeling of both mainstream and long-tail items. Finally, contrastive learning aligns these multi-source representations. Extensive experiments demonstrate SPARK's significant superiority over state-of-the-art methods, particularly in improving long-tail item recommendation, offering a robust, principled approach to knowledge-enhanced recommendation. Implementation code is available at https://github.com/Applied-Machine-Learning-Lab/SPARK.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.10392": {
            "title": "Diversified recommendations of cultural activities with personalized determinantal point processes",
            "authors": "Carole Ibrahim, Hiba Bederina, Daniel Cuesta, Laurent Montier, Cyrille Delabre, Jill-Jênn Vie",
            "first_author": "Carole Ibrahim",
            "url": "http://arxiv.org/abs/2509.10392v1",
            "pdf_url": "http://arxiv.org/abs/2509.10392",
            "publish_date": "2025-09-12",
            "abstract": "While optimizing recommendation systems for user engagement is a well-established practice, effectively diversifying recommendations without negatively impacting core business metrics remains a significant industry challenge. In line with our initiative to broaden our audience's cultural practices, this study investigates using personalized Determinantal Point Processes (DPPs) to sample diverse and relevant recommendations. We rely on a well-known quality-diversity decomposition of the similarity kernel to give more weight to user preferences. In this paper, we present our implementations of the personalized DPP sampling, evaluate the trade-offs between relevance and diversity through both offline and online metrics, and give insights for practitioners on their use in a production environment. For the sake of reproducibility, we release the full code for our platform and experiments on GitHub.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.09877": {
            "title": "How to Fight Fraudulent Publishing in the Mathematical Sciences: Joint Recommendations of the IMU and the ICIAM",
            "authors": "Ilka Agricola, Lynn Heller, Wil Schilders, Moritz Schubotz, Peter Taylor, Luis Vega",
            "first_author": "Ilka Agricola",
            "url": "http://arxiv.org/abs/2509.09877v1",
            "pdf_url": "http://arxiv.org/abs/2509.09877",
            "publish_date": "2025-09-11",
            "abstract": "These recommendations were formulated by the authors in close collaboration with the IMU Committee on Publishing (chaired by Ilka Agricola) and have been endorsed by the Executive Committee of the IMU and the Board of the ICIAM in May/June 2025.",
            "primary_category": "math.HO",
            "code_url": "null"
        },
        "2509.09583": {
            "title": "Personality-Enhanced Social Recommendations in SAMI: Exploring the Role of Personality Detection in Matchmaking",
            "authors": "Brittany Harbison, Samuel Taubman, Travis Taylor, Ashok. K. Goel",
            "first_author": "Brittany Harbison",
            "url": "http://arxiv.org/abs/2509.09583v1",
            "pdf_url": "http://arxiv.org/abs/2509.09583",
            "publish_date": "2025-09-11",
            "abstract": "Social connection is a vital part of learning, yet online course environments present barriers to the organic formation of social groups. SAMI offers one solution by facilitating student connections, but its effectiveness is constrained by an incomplete Theory of Mind, limiting its ability to create an effective mental model of a student. One facet of this is its inability to intuit personality, which may influence the relevance of its recommendations. To explore this, we propose a personality detection model utilizing GPTs zero-shot capability to infer Big-Five personality traits from forum introduction posts, often encouraged in online courses. We benchmark its performance against established models, demonstrating its efficacy in this task. Furthermore, we integrate this model into SAMIs entity-based matchmaking system, enabling personality-informed social recommendations. Initial integration suggests personality traits can complement existing matching factors, though additional evaluation is required to determine their full impact on student engagement and match quality.",
            "primary_category": "cs.CL",
            "code_url": "null"
        },
        "2509.09342": {
            "title": "CESRec: Constructing Pseudo Interactions for Sequential Recommendation via Conversational Feedback",
            "authors": "Yifan Wang, Shen Gao, Jiabao Fang, Rui Yan, Billy Chiu, Shuo Shang",
            "first_author": "Yifan Wang",
            "url": "http://arxiv.org/abs/2509.09342v1",
            "pdf_url": "http://arxiv.org/abs/2509.09342",
            "publish_date": "2025-09-11",
            "abstract": "Sequential Recommendation Systems (SRS) have become essential in many real-world applications. However, existing SRS methods often rely on collaborative filtering signals and fail to capture real-time user preferences, while Conversational Recommendation Systems (CRS) excel at eliciting immediate interests through natural language interactions but neglect historical behavior. To bridge this gap, we propose CESRec, a novel framework that integrates the long-term preference modeling of SRS with the real-time preference elicitation of CRS. We introduce semantic-based pseudo interaction construction, which dynamically updates users'historical interaction sequences by analyzing conversational feedback, generating a pseudo-interaction sequence that seamlessly combines long-term and real-time preferences. Additionally, we reduce the impact of outliers in historical items that deviate from users'core preferences by proposing dual alignment outlier items masking, which identifies and masks such items using semantic-collaborative aligned representations. Extensive experiments demonstrate that CESRec achieves state-of-the-art performance by boosting strong SRS models, validating its effectiveness in integrating conversational feedback into SRS.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.09146": {
            "title": "Peering Partner Recommendation for ISPs using Machine Learning",
            "authors": "Md Ibrahim Ibne Alam, Ankur Senapati, Anindo Mahmood, Murat Yuksel, Koushik Kar",
            "first_author": "Md Ibrahim Ibne Alam",
            "url": "http://arxiv.org/abs/2509.09146v1",
            "pdf_url": "http://arxiv.org/abs/2509.09146",
            "publish_date": "2025-09-11",
            "abstract": "Internet service providers (ISPs) need to connect with other ISPs to provide global connectivity services to their users. To ensure global connectivity, ISPs can either use transit service(s) or establish direct peering relationships between themselves via Internet exchange points (IXPs). Peering offers more room for ISP-specific optimizations and is preferred, but it often involves a lengthy and complex process. Automating peering partner selection can enhance efficiency in the global Internet ecosystem. We explore the use of publicly available data on ISPs to develop a machine learning (ML) model that can predict whether an ISP pair should peer or not. At first, we explore public databases, e.g., PeeringDB, CAIDA, etc., to gather data on ISPs. Then, we evaluate the performance of three broad types of ML models for predicting peering relationships: tree-based, neural network-based, and transformer-based. Among these, we observe that tree-based models achieve the highest accuracy and efficiency in our experiments. The XGBoost model trained with publicly available data showed promising performance, with a 98% accuracy rate in predicting peering partners. In addition, the model demonstrated great resilience to variations in time, space, and missing data. We envision that ISPs can adopt our method to fully automate the peering partner selection process, thus transitioning to a more efficient and optimized Internet ecosystem.",
            "primary_category": "cs.LG",
            "code_url": "null"
        },
        "2509.09114": {
            "title": "Modality Alignment with Multi-scale Bilateral Attention for Multimodal Recommendation",
            "authors": "Kelin Ren, Chan-Yang Ju, Dong-Ho Lee",
            "first_author": "Kelin Ren",
            "url": "http://arxiv.org/abs/2509.09114v1",
            "pdf_url": "http://arxiv.org/abs/2509.09114",
            "publish_date": "2025-09-11",
            "abstract": "Multimodal recommendation systems are increasingly becoming foundational technologies for e-commerce and content platforms, enabling personalized services by jointly modeling users' historical behaviors and the multimodal features of items (e.g., visual and textual). However, most existing methods rely on either static fusion strategies or graph-based local interaction modeling, facing two critical limitations: (1) insufficient ability to model fine-grained cross-modal associations, leading to suboptimal fusion quality; and (2) a lack of global distribution-level consistency, causing representational bias. To address these, we propose MambaRec, a novel framework that integrates local feature alignment and global distribution regularization via attention-guided learning. At its core, we introduce the Dilated Refinement Attention Module (DREAM), which uses multi-scale dilated convolutions with channel-wise and spatial attention to align fine-grained semantic patterns between visual and textual modalities. This module captures hierarchical relationships and context-aware associations, improving cross-modal semantic modeling. Additionally, we apply Maximum Mean Discrepancy (MMD) and contrastive loss functions to constrain global modality alignment, enhancing semantic consistency. This dual regularization reduces mode-specific deviations and boosts robustness. To improve scalability, MambaRec employs a dimensionality reduction strategy to lower the computational cost of high-dimensional multimodal features. Extensive experiments on real-world e-commerce datasets show that MambaRec outperforms existing methods in fusion quality, generalization, and efficiency. Our code has been made publicly available at https://github.com/rkl71/MambaRec.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.09066": {
            "title": "Instructional Prompt Optimization for Few-Shot LLM-Based Recommendations on Cold-Start Users",
            "authors": "Haowei Yang, Yushang Zhao, Sitao Min, Bo Su, Chao Yao, Wei Xu",
            "first_author": "Haowei Yang",
            "url": "http://arxiv.org/abs/2509.09066v1",
            "pdf_url": "http://arxiv.org/abs/2509.09066",
            "publish_date": "2025-09-11",
            "abstract": "The cold-start user issue further compromises the effectiveness of recommender systems in limiting access to the historical behavioral information. It is an effective pipeline to optimize instructional prompts on a few-shot large language model (LLM) used in recommender tasks. We introduce a context-conditioned prompt formulation method P(u,\\ Ds)\\ \\rightarrow\\ R\\widehat, where u is a cold-start user profile, Ds is a curated support set, and R\\widehat is the predicted ranked list of items. Based on systematic experimentation with transformer-based autoregressive LLMs (BioGPT, LLaMA-2, GPT-4), we provide empirical evidence that optimal exemplar injection and instruction structuring can significantly improve the precision@k and NDCG scores of such models in low-data settings. The pipeline uses token-level alignments and embedding space regularization with a greater semantic fidelity. Our findings not only show that timely composition is not merely syntactic but also functional as it is in direct control of attention scales and decoder conduct through inference. This paper shows that prompt-based adaptation may be considered one of the ways to address cold-start recommendation issues in LLM-based pipelines.",
            "primary_category": "cs.AI",
            "code_url": "null"
        },
        "2509.09037": {
            "title": "Envy-Free but Still Unfair: Envy-Freeness Up To One Item (EF-1) in Personalized Recommendation",
            "authors": "Amanda Aird, Ben Armstrong, Nicholas Mattei, Robin Burke",
            "first_author": "Amanda Aird",
            "url": "http://arxiv.org/abs/2509.09037v1",
            "pdf_url": "http://arxiv.org/abs/2509.09037",
            "publish_date": "2025-09-10",
            "abstract": "Envy-freeness and the relaxation to Envy-freeness up to one item (EF-1) have been used as fairness concepts in the economics, game theory, and social choice literatures since the 1960s, and have recently gained popularity within the recommendation systems communities. In this short position paper we will give an overview of envy-freeness and its use in economics and recommendation systems; and illustrate why envy is not appropriate to measure fairness for use in settings where personalization plays a role.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.08231": {
            "title": "Deploying Robust Decision Support Systems for Transit Headway Control: Rider Impacts, Human Factors and Recommendations for Scalability",
            "authors": "Joseph Rodriguez, Haris N. Koutsopoulos, Jinhua Zhao",
            "first_author": "Joseph Rodriguez",
            "url": "http://arxiv.org/abs/2509.08231v1",
            "pdf_url": "http://arxiv.org/abs/2509.08231",
            "publish_date": "2025-09-10",
            "abstract": "Service reliability is critical to transit service delivery. This paper describes headway control pilots conducted in two high-ridership Chicago bus routes between 2022 and 2023. A decision support system was developed for a bus holding strategy based on a reinforcement learning approach. For the pilots, a user interface enabled supervisors to monitor service and record applied actions. The first pilot tested terminal-based holding on a route affected by missed trips from absenteeism. The analysis found improvements in reliability, and the application of control was shown to outperform days with more service. The second pilot applied en-route holding in a high-ridership bus route in Chicago. The evaluation showed wait time improvements with rippled benefits to stops downstream, and a reduction in transfer times from connecting bus and rail lines. Compliance analysis based on the supervisor logs on the app revealed mixed compliance levels from drivers, which were related to the mentality of schedule adherence and seniority. Recommendations are provided for practitioners to scale similar efforts.",
            "primary_category": "stat.AP",
            "code_url": "null"
        },
        "2509.07319": {
            "title": "MEGG: Replay via Maximally Extreme GGscore in Incremental Learning for Neural Recommendation Models",
            "authors": "Yunxiao Shi, Shuo Yang, Haimin Zhang, Li Wang, Yongze Wang, Qiang Wu, Min Xu",
            "first_author": "Yunxiao Shi",
            "url": "http://arxiv.org/abs/2509.07319v1",
            "pdf_url": "http://arxiv.org/abs/2509.07319",
            "publish_date": "2025-09-09",
            "abstract": "Neural Collaborative Filtering models are widely used in recommender systems but are typically trained under static settings, assuming fixed data distributions. This limits their applicability in dynamic environments where user preferences evolve. Incremental learning offers a promising solution, yet conventional methods from computer vision or NLP face challenges in recommendation tasks due to data sparsity and distinct task paradigms. Existing approaches for neural recommenders remain limited and often lack generalizability. To address this, we propose MEGG, Replay Samples with Maximally Extreme GGscore, an experience replay based incremental learning framework. MEGG introduces GGscore, a novel metric that quantifies sample influence, enabling the selective replay of highly influential samples to mitigate catastrophic forgetting. Being model-agnostic, MEGG integrates seamlessly across architectures and frameworks. Experiments on three neural models and four benchmark datasets show superior performance over state-of-the-art baselines, with strong scalability, efficiency, and robustness. Implementation will be released publicly upon acceptance.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.07269": {
            "title": "Datasets for Navigating Sensitive Topics in Recommendation Systems",
            "authors": "Amelia Kovacs, Jerry Chee, Kimia Kazemian, Sarah Dean",
            "first_author": "Amelia Kovacs",
            "url": "http://arxiv.org/abs/2509.07269v1",
            "pdf_url": "http://arxiv.org/abs/2509.07269",
            "publish_date": "2025-09-08",
            "abstract": "Personalized AI systems, from recommendation systems to chatbots, are a prevalent method for distributing content to users based on their learned preferences. However, there is growing concern about the adverse effects of these systems, including their potential tendency to expose users to sensitive or harmful material, negatively impacting overall well-being. To address this concern quantitatively, it is necessary to create datasets with relevant sensitivity labels for content, enabling researchers to evaluate personalized systems beyond mere engagement metrics. To this end, we introduce two novel datasets that include a taxonomy of sensitivity labels alongside user-content ratings: one that integrates MovieLens rating data with content warnings from the Does the Dog Die? community ratings website, and another that combines fan-fiction interaction data and user-generated warnings from Archive of Our Own.",
            "primary_category": "cs.IR",
            "code_url": "null"
        },
        "2509.07133": {
            "title": "Avoiding Over-Personalization with Rule-Guided Knowledge Graph Adaptation for LLM Recommendations",
            "authors": "Fernando Spadea, Oshani Seneviratne",
            "first_author": "Fernando Spadea",
            "url": "http://arxiv.org/abs/2509.07133v1",
            "pdf_url": "http://arxiv.org/abs/2509.07133",
            "publish_date": "2025-09-08",
            "abstract": "We present a lightweight neuro-symbolic framework to mitigate over-personalization in LLM-based recommender systems by adapting user-side Knowledge Graphs (KGs) at inference time. Instead of retraining models or relying on opaque heuristics, our method restructures a user's Personalized Knowledge Graph (PKG) to suppress feature co-occurrence patterns that reinforce Personalized Information Environments (PIEs), i.e., algorithmically induced filter bubbles that constrain content diversity. These adapted PKGs are used to construct structured prompts that steer the language model toward more diverse, Out-PIE recommendations while preserving topical relevance. We introduce a family of symbolic adaptation strategies, including soft reweighting, hard inversion, and targeted removal of biased triples, and a client-side learning algorithm that optimizes their application per user. Experiments on a recipe recommendation benchmark show that personalized PKG adaptations significantly increase content novelty while maintaining recommendation quality, outperforming global adaptation and naive prompt-based methods.",
            "primary_category": "cs.IR",
            "code_url": "null"
        }
    }
}